system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-15  0  -30)   // 0
    ( 15  0  -30)   // 1
    ( 15  30 -30)   // 2
    (-15  30 -30)   // 3
    (-15  0   90)   // 4
    ( 15  0   90)   // 5
    ( 15  30  90)   // 6
    (-15  30  90)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 120) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    others
    {
        type symmetry;
        faces
        (
            (0 3 7 4)
            (1 5 6 2)
            (3 2 6 7)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }

    floor
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
);

mergePatchPairs
(
);
