0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 4); 

boundaryField
{
    inlet 
    {
        type            atmBoundaryLayerInletVelocity;
        Uref            4.0;          
        Zref            10.0;         
        zDir            (0 1 0);      
        flowDir         (0 0 1);      
        z0              uniform 0.05; 
        d               uniform 0.0;  // <--- ADD THIS LINE
        value           uniform (0 0 4);
    }

    outlet 
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    floor
    {
        type            noSlip;
    }

    d  // This refers to your building geometry
    {
        type            noSlip;
    }

    others
    {
        type            symmetry;
    }
}