0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        Uref            4.0;
        Zref            10.0;
        zDir            (0 1 0);
        flowDir         (0 0 1);
        z0              uniform 0.05;
        d               uniform 0.0;  // <--- ADD THIS LINE
        value           uniform 0.01;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }

    floor
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    d
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    others
    {
        type            symmetry;
    }
}