system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        // PCG is more robust than GAMG for bad meshes/initial divergence
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    
    // Changed to 'no' for standard SIMPLE algorithm (more stable start)
    consistent      no;

    residualControl
    {
        p               1e-4;
        U               1e-6;
        k               1e-6;
        epsilon         1e-6;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3; // Standard SIMPLE pressure relaxation
    }
    equations
    {
        U               0.7; // Standard SIMPLE velocity relaxation
        k               0.7;
        epsilon         0.7;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //